SELECT AVG(hp_max) FROM heros;
-- +-------------------+
-- | AVG(hp_max)       |
-- +-------------------+
-- | 6580.478260869565 |
-- +-------------------+
-- 1 row in set (0.00 sec)
SELECT name, birthdate FROM heros WHERE DATE(birthdate) > '2017-01-01'  AND birthdate IS NOT NULL;
-- +--------------+------------+
-- | name         | birthdate  |
-- +--------------+------------+
-- | 东皇太一     | 2017-03-30 |
-- | 干将莫邪     | 2017-05-22 |
-- | 大乔         | 2017-02-28 |
-- | 鬼谷子       | 2017-06-29 |
-- | 哪吒         | 2017-01-12 |
-- | 百里守约     | 2017-08-08 |
-- +--------------+------------+
-- 6 rows in set (0.00 sec)

SELECT name, birthdate FROM heros WHERE DATE(birthdate) > '2017-01-01';
-- +--------------+------------+
-- | name         | birthdate  |
-- +--------------+------------+
-- | 东皇太一     | 2017-03-30 |
-- | 干将莫邪     | 2017-05-22 |
-- | 大乔         | 2017-02-28 |
-- | 鬼谷子       | 2017-06-29 |
-- | 哪吒         | 2017-01-12 |
-- | 百里守约     | 2017-08-08 |
-- +--------------+------------+
-- 6 rows in set (0.00 sec)